Revit 2024 API
BuiltInFailures.AutoRouteFailures.OverrideFabricationPartFailed Property
 The fabrication part cannot be overridden. The button code you specified does not match the fabrication service. Please specify a different button code or check the fabrication service and try again.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId OverrideFabricationPartFailed { get; }
Visual Basic
Public Shared ReadOnly Property OverrideFabricationPartFailed As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ OverrideFabricationPartFailed {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace